Step 1: Set Up SQLite and Connect

In [2]:
import sqlite3
from datetime import date
import pandas as pd

# Create/Connect to the database
conn = sqlite3.connect('edu_institute.db')
cursor = conn.cursor()

Step 2: Create the Database and Table

In [3]:
# 1.2 Create table students
cursor.execute('''
CREATE TABLE IF NOT EXISTS students (
    student_id INTEGER PRIMARY KEY,
    name VARCHAR(50),
    age INTEGER,
    gender CHAR(1),
    enrollment_date DATE,
    program VARCHAR(50)
);
''')
conn.commit()

Step 3: Insert Records

In [4]:
# 2.1 Insert 5 students, at least one in Data Science
cursor.executemany('''
INSERT INTO students (student_id, name, age, gender, enrollment_date, program)
VALUES (?, ?, ?, ?, ?, ?)
''', [
    (1, 'Alice Johnson', 21, 'F', '2023-08-21', 'Data Science'),
    (2, 'Brian O\'Neil', 23, 'M', '2023-01-15', 'Computer Science'),
    (3, 'Chloe Zhang', 20, 'F', '2024-02-20', 'Physics'),
    (4, 'David Kim', 19, 'M', '2024-03-11', 'Mathematics'),
    (5, 'Ella Martinez', 22, 'F', '2022-09-10', 'Chemistry')
])
conn.commit()

Step 4: Basic Queries

3.1 Select all columns for students in Data Science

In [5]:
df = pd.read_sql_query("SELECT * FROM students WHERE program = 'Data Science';", conn)
print(df)

   student_id           name  age gender enrollment_date       program
0           1  Alice Johnson   21      F      2023-08-21  Data Science

3.2 Count total number of students

In [6]:
df = pd.read_sql_query("SELECT COUNT(*) AS 'Total Students' FROM students;", conn)
print(df)

   Total Students
0               5

Step 5: Function Usage

4.1 Display current date in a column named Today's Date

(SQLite syntax: use DATE('now'))

In [7]:
df = pd.read_sql_query("SELECT DATE('now') AS 'Today''s Date';", conn)
print(df)

  Today's Date
0   2025-06-25

Select names (uppercase) and enrollment dates

In [8]:
df = pd.read_sql_query("SELECT UPPER(name) AS name, enrollment_date FROM students;", conn)
print(df)

            name enrollment_date
0  ALICE JOHNSON      2023-08-21
1   BRIAN O'NEIL      2023-01-15
2    CHLOE ZHANG      2024-02-20
3      DAVID KIM      2024-03-11
4  ELLA MARTINEZ      2022-09-10

Step 6: Advanced Queries

5.1 Count students in each program (descending)

In [9]:
df = pd.read_sql_query(
    "SELECT program, COUNT(*) AS 'Number of Students' FROM students GROUP BY program ORDER BY COUNT(*) DESC;", conn)
print(df)

            program  Number of Students
0           Physics                   1
1       Mathematics                   1
2      Data Science                   1
3  Computer Science                   1
4         Chemistry                   1

5.2 Find youngest student's name and age

In [10]:
df = pd.read_sql_query(
    "SELECT name, age FROM students WHERE age = (SELECT MIN(age) FROM students);", conn)
print(df)

        name  age
0  David Kim   19